class DuaModelDetails{
  int? id;
  String? title;
  String? textArab;
  String? textUrdu;
  String? textProof;
  DuaModelDetails({this.id,this.title,this.textArab,this.textUrdu,this.textProof});
}
var duaModelDetail =
[
  DuaModelDetails(id: 1,title: "کھانے سے پہلے کی دعا",textArab: "بِسْمِ اللّٰہِ وَعَلٰی بَرَكَةِ اللّٰہِ",textUrdu: "میں نے الله کے نام کے ساتھ اور الله کی برکت پر کھانا شروع کیا",textProof: "(مشكاة المصابيح 2/446،بيروت)"),
  DuaModelDetails(id: 2,title: "کھانے کے بعد کی دعا",textArab: "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِينَ",textUrdu: "اللہ عزوجل کا شکر ہے جس نے ہمیں کھلایا پلایا اور مسلمانوں میں سے بنایا",textProof: "(سنن أبي داود، 3/407، بيروت)"),
  DuaModelDetails(id: 3,title: "سوتے وقت کی دعا",textArab: "اَللّٰھُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",textUrdu: "الٰہی عزوجل میں تیرے نام پر مرتا ہوں اور جیتا ہوں",textProof: "(سنن الترمذي، 5/471، بيروت)"),
  DuaModelDetails(id: 4,title: "نیند سے بیدار ہونے کی دعا",textArab: "َالْحَمْدُ لِلّٰہِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",textUrdu: "تمام تعریفیں اللہ عزوجل کے لئے جس نے ہمیں موت (نیند) کے بعد حیات (بیداری) عطا فرمائی اور ہمیں اسی طرف لوٹنا ہے",textProof: "(صحيح مسلم، 8/78، بيروت)"),
  DuaModelDetails(id: 5,title: "گھر میں داخل ہوتے وقت کی دعا",textArab: "اَللّٰھُمَّ اِنِّیْ اَسْئَلُكَ خَیْرَالْمَوْلَجِ وَخَیْرَالْمَخْرَجِ",textUrdu: "اے اللہ عَزَّ وَجَلَّ ! میں تجھ سے داخل ہونے اور نکلنے کی جگہوں کی بھلائی طلب کرتا ہوں",textProof: "(سنن أبي داود، 4/486، بيروت)"),
  DuaModelDetails(id: 6,title: "گھر سے نکلتے وقت کی دعا",textArab: "بِسْمِ اللّٰہِ تَوَكَّلْتُ عَلَى اللّٰہِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰہِ",textUrdu: "اللہ عزوجل کے نام سے (گھر سے نکلتا ہوں) میں نے اللہ عزوجل پر بھروسہ کیا اللہ عزوجل کے بغیر نہ طاقت ہے (گناہوں سے بچنےکی) اور نہ طاقت  ہے (نیکیاں کرنے کی)",textProof: "(سنن الترمذي، 5/490، بيروت)،"),
  DuaModelDetails(id: 7,title: "مسجد میں داخل ہونے کی دعا",textArab: "اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِکَ",textUrdu: "اے اللہ! میرے لیے رحمت کے دروازے کھول دے",textProof: "(صحيح مسلم، 2/155، بيروت)"),
  DuaModelDetails(id: 8,title: "مسجد سے نکلنے کی دعا",textArab: "اَللّٰهُمَّ اِنِّيْ اَسْاَلُکَ مِنْ فَضْلِکَ وَرَحْمَتِکَ",textUrdu: "اے اللہ! میں تجھ سے تیرا فضل اور تیری رحمت مانگتا ہوں",textProof: "(سنن الترمذي، 2/127)"),
  DuaModelDetails(id: 9,title: "سفر اور سواری کی دعا",textArab: "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",textUrdu: "اللہ عزوجل کا شکر ہے، پاک ہے وہ جس نے ہمارے لئے اس(سواری کو) مسخر کیا اور ہم اس کو فرمانبردار نہیں بنا سکتے تھے",textProof: "(مشكاة المصابيح 2/752، بیروت)"),
  DuaModelDetails(id: 10,title: "بیت الخلاء میں داخل ہونے سے پہلے کی دعا",textArab: "اَللّٰھُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",textUrdu: "اے اللہ عزوجل میں ناپاک جنوں (نرو مادہ) سے تیری پناہ مانگتا ہوں",textProof: "(سنن الترمذي، (2 /503)، بيروت)"),
  DuaModelDetails(id: 11,title: "بیت الخلاء سے باہر آنے کے بعد کی دعا",textArab: "اَلْحَمْدُ لِلّٰہِ الَّذِي أَذْهَبَ عَنِّي الْأَذَى وَعَافَانِي",textUrdu: "اللہ عزوجل کا شکر ہے جس نے مجھ سے اذیت دور کی اور مجھے عافیت دی",textProof: "(السنن الكبرى للنسائي، ٩/ 35،بيروت)"),
  DuaModelDetails(id: 12,title: "دودھ پینے کے بعد کی دعا",textArab: "اَللّٰهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",textUrdu: "یا الٰہی عزوجل ہمارے لئے اس میں برکت دے اور ہمیں اس سے زیادہ عنایت فرما",textProof: "( ترمذی حدیث 4455)"),
  DuaModelDetails(id: 13,title: "نیا چاند دیکھتے وقت کی دعا",textArab: "اَللّٰهُمَّ أَهِلَّهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ وَالتَّوْفِيقِ لِمَا تُحِبُّ وَتَرْضیٰ رَبِّي وَرَبُّكَ اللّٰہُ",textUrdu: "یا الٰہی عزوجل اس چاند کو ہم پر برکت کے ساتھ اور ایمان و سلامتی اور اسلام اور اس چیز کی توفیق کے ساتھ نکال جس سے تو راضی ہوتا ہے اور پسند کرتا ہے، (اے پہلی رات کے چاند) میرا اور تیرا رب اللہ عزوجل ہے",textProof: "(سنن الترمذي، 5/504)"),
  DuaModelDetails(id: 14,title: "روزہ رکھنے کی نیت",textArab: "وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ",textUrdu: "اورمیں نے ماہ رمضان کے کل کے روزے کی نیت کی",textProof: "یہ دعا نہیں بلکہ نیت کے الفاظ ہیں"),
  DuaModelDetails(id: 15,title: "روزہ افطار کرنے کی دعا",textArab: "اَللّٰهُمَّ اِنِّی لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ",textUrdu: "اے اللہ!میں نے تیری خاطر روزہ رکھا اور تیرے اوپر ایمان لایا اور تجھ پر بھروسہ کیا اورتیرے رزق سے اسے کھول رہا ہوں",textProof: "( سنن أبي داؤد،کتاب الصیام)"),
  DuaModelDetails(id: 16,title: "آئنہ دیکھتے وقت کی دعا",textArab: "اَللّٰهُمَّ أَنْتَ حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",textUrdu: "اللہ عزوجل تو نے میری صورت اچھی بنائی تو میری سیرت (اخلاق) بھی اچھی کردے",textProof: "(مشكاة المصابيح، 2/1411، بیروت)"),
];